const blogList = [
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog1",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog2",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog3",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog4",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
];

export default blogList;
