const blogList = [
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "6-habits-for-be-a-better-programmer",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟",
    content: `<p dir="RTL">من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند.</p>
<p dir="RTL">تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای <strong><a href="https://roocket.ir/podcast/1052">بهتر شدن</a></strong> را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.</p>
<h2 dir="RTL">عادت اول: سازگار شوید</h2>
<p dir="RTL">به عنوان اولین نکته و عادتی که باید داشته باشید باید بگویم که برنامه نویس خوب کسی است که می‌تواند به راحتی با چیزهای مختلف سازگار شده و در مقابل‌شان گارد نگیرد. شما باید به نسبت تکنولوژی‌ها و روش‌های جدید سازگاری از خود نشان داده و در مسیر یادگیری و تسلط پیدا کردن روی آن‌ها تلاش کنید. اگر چنین کاری را انجام ندهید مطمئنا بعد از چند سال، تکنولوژی‌هایی که می‌دانید قدیمی شده و استفاده پذیری آن‌ها کاهش پیدا می‌کند.</p>
<p dir="RTL">برخی افراد به جای آنکه تکنولوژي‌های جدید را یاد بگیرند، روزها و ساعت‌ها وقت خود را روی این قضیه تلف می‌کنند که به چه صورتی بهانه‌ای برای انجام ندادن فرایند یادگیری دست و پا کنند. بعد از این کار نیز روزها و ساعت‌ها وقت روی این قضیه تلف می‌کنند که به دیگران اثبات کنند که چرا از فلان تکنولوژی جدید بیزار هستند. به جای تمام این موارد، حقیقت ماجرا را درک کرده و فرایند یادگیری و استفاده از آن‌ها را شروع کنید.</p>
<h2 dir="RTL">عادت دوم: از یادگیری دست برندارید</h2>
<p dir="RTL">اگر قصد دارید به یک متخصص تبدیل شده و روی کارتان بیشتر از هر چیزی تمرکز کنید باید بدانید که تنها روش برای دستیابی به چنین چیزی یادگیری مداوم و تکرار فرایند آموزش است. می‌دانیم که فرایند آموزش گاهی اوقات خسته کننده است اما خوشبختانه روش‌های مختلفی برای آموزش وجود دارد که در صورت خسته شدن از یک متد آن می‌توانید به سرعت روی دیگر روش‌ها کار بکنید.</p>
<p dir="RTL">ویدیو نگاه کنید، اگر خسته شدید به کتاب‌ها نگاهی بیاندازید، اگر از کتاب‌ها خواستید دوری بجویید سراغ بازی‌های آموزشی بروید. ده‌ها نوع روش برای آموزش وجود دارد که هر کدام را می‌توانید در بازه‌های زمانی و حال‌ و هواهای متفاوت پیش ببرید.</p>
<h2 dir="RTL">عادت سوم: مرتب و منظم باشید</h2>
<p dir="RTL">شلخته و نامرتب بودن یکی از عوامل اصلی برای هواس پرت کردن است. اگر بخواهید چیزی یاد بگیرید و یا روی کاری تمرکز کنید نیاز دارید که مرتب و منظم باشید. حقیقتا این موضوع تنها در ارتباط با محیط اطراف نیست بلکه ساختار مغزی خود را نیز باید مرتب و منظم نگه داریم.</p>
<p dir="RTL">مطمئنا این مرحله سخت‌ترین کار است چرا که ذهن ما به صورت کلی به شکلی طراحی شده که مدام مراقب چیزهای مختلف باشد و روی یک چیز تمرکز نکند به همین دلیل است که در این مسیر با به تمرین نیاز داریم تا بتوانیم این تکنیک را یاد بگیریم.</p>
<p dir="RTL">بنابراین برای رعایت این نکته دو موضوع را در نظر بگیرید: ۱- اتاق کار و محیط خود را منظم و مرتب نگه داشته و از هر گونه شلختی و نامرتب بودن دوری کنید. ۲- سعی کنید به ذهن‌تان انسجام ببخشید و در هر زمان به یک موضوع متفاوت فکر نکنید.</p>
<h2 dir="RTL">عادت چهارم: دانش‌تان را به اشتراک بگذارید</h2>
<p dir="RTL">مدت زیادی است که ما در راکت به این نکته اشاره کرده‌ایم که <strong><a href="https://roocket.ir/podcast/1029">مطالب خودتان را به اشتراک بگذارید</a></strong> و فکر نکنید که اگر موضوعی را به یک فرد دیگر تدریس کنید یا راجع به آن صحبت کنید برای‌تان خطرناک می‌شود. خیر! آموزش و به اشتراک گذاشتن دانش‌تان به شما کمک می‌کند تا موضوع را بهتر بشناسید و بهتر آن را درک کنید.</p>
<p dir="LTR"><img class="lozad" data-src="https://static.roocket.ir/images/editor/2023/7/4/VojJQT3advETbuQshz7jDqDxrZAOaNbMKhyg0W6e.png" width="624" height="351" border="0" src="https://static.roocket.ir/images/editor/2023/7/4/VojJQT3advETbuQshz7jDqDxrZAOaNbMKhyg0W6e.png" data-loaded="true"></p>
<p dir="RTL">انجام چنین کاری هزینه نخواهد داشت چرا که شما در حالت‌های مختلف می‌توانید این کار را با سرویس‌های رایگان انجام دهید. برای مثال می‌توانید یک <strong><a href="http://dev.to/" target="_blank" rel="noopener nofollow">وبلاگ</a></strong> بسازید و به صورت متن موضوعات مورد نظرتان را به اشتراک بگذارید، می‌توانید یک <strong><a href="https://youtube.com/" target="_blank" rel="noopener nofollow">کانال یوتیوبی</a></strong> درست کرده و در آنجا به آموزش بپردازید و حتی می‌توانید به صورت پادکست این کار را انجام بدهید.</p>
<h2 dir="RTL">عادت پنجم: برنامه ریزی و پلن داشته باشید</h2>
<p dir="RTL">کار کردن در تیم‌ها یا به صورت کارآموزی این امکان را به شما می‌دهد که با یک پلن از پیش آماده روبرو بوده و براساس آن پیش بروید. اما همیشه این اتفاق نمی‌افتد چرا که شما در زندگی شخصی و کارهای شخصی باید خودتان دست به کار شده و برای آینده و کاری که می‌کنید برنامه ریزی بکنید.</p>
<p dir="RTL">در این زمینه باید یاد بگیرید که چگونه برنامه ریزی کرده و پلن‌های روزانه، هفتگی و ماهیانه خود را تعیین کنید. کار چندان سختی نخواهد بود به شرطی که دقیقا بدانید دنبال چه چیزی هستید و قصد دارید به چیزی دست پیدا کنید.</p>
<h2 dir="RTL">عادت ششم: انسان باشید!</h2>
<p dir="RTL">عنوان آخر این مقاله مطمئنا برای‌تان عجیب و غریب است و کمی غلط انداز! اما منظور از این عنوان این است که سعی کنید بیشتر از آنکه شبیه یک ماشین یا کامپیوتر باشید، بیشتر به انسان بودن خودتان برگردید. برای این موضوع به نکات زیر نگاه کنید:</p>
<ol>
<li dir="RTL"><strong><em>با دیگران در ارتباط داشته باشید</em></strong>: به این معنا که در تنهایی خود غوطه نخورید و بیرون بیایید. با دیگران معاشرت داشته باشید و سعی کنید دوست پیدا کنید. اگر در شرکت کار می‌کنید سعی کنید که با دیگران معاشرت داشته و در ارتباط باشید. هیچ شرکتی از یک فرد که نمی‌تواند با جمع و گروه دوست بشود خوشش نمی‌آيد.</li>
<li dir="RTL"><strong><em>استراحت کنید</em></strong>: استراحت کردن چیزی‌ست که هر انسانی به آن نیاز دارد. دلیلی ندارد که صبح تا شب روبروی کامپیوتر نشسته و کارها را انجام دهید. بلکه در بازه‌های زمانی مختلف به خودتان استراحت داده و خودتان را به چیز دیگری مشغول کنید یا به صورت کلی ریلکس کنید. چک کردن موبایل و... نمی‌تواند به مغزتان استراحت بدهد در نتیجه از میزتان دور شده و برای مثال به گل‌ها آب بدهید.</li>
<li dir="RTL"><strong><em>به خودتان جایزه داده و مسافرت کنید</em></strong>: در بازه‌های زمانی مختلف به خودتان جایزه بدهید. برای مثال ماهی چند بار به یک رستوران با کیفیت بروید و برای خودتان غذای خوبی سفارش بدهید. همچنین می‌توانید به مسافرت بروید و برای حداقل چند روز کلا از فضای برنامه نویسی دوری کنید.</li>
</ol>
<h2 dir="RTL">در پایان</h2>
<p dir="RTL">موضوعاتی که در این مقاله بحث شد مطمئنا هر کدام کاربرد خود را داشته و می‌تواند در زمینه‌های مختلف به شما کمک بکند. نتیجه تمام این کارها این است که در نهایت شما بتوانید به یک برنامه نویس بهتری تبدیل شده و در زمینه تخصصی خود بهتر پیش بروید.</p>
<a href="https://roocket.ir/articles/6-habits-for-be-a-better-programmer" style="color:red" target="_blank">لینک مقاله در وبسایت راکت</a>
`,
    author: {
      name: "ارسطو عباسی",
      image: "/images/author1.webp",
    },
  },
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog2",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog3",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
  {
    title: "6 عادت برای تبدیل شدن به یک برنامه نویس بهتر",
    slug: "blog4",
    image: "/images/article1.webp",
    date: "1401/4/21",
    short:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟",
    content:
      "من یک توسعه دهنده و طراح وبسایت هستم، بیشتر اوقات هم فکر می‌کنم که آدم درست و حسابی و توانمندی در زمینه کاری‌ام هستم اما همیشه این سوال را از خودم می‌پرسم که آیا راهی برای بهتر شدن به نسبت وضع اکنون هست یا نه؟ اگر که در حال خواندن این مقاله هستید باید بگویم که این مقاله دقیقا چنین هدفی را دارد. یعنی شما را با مواردی آشنا کند که در مسیر بهتر شدن به شما می‌تواند کمک بکند. تنها با پنج دقیقه وقت گذاشتن و مطالعه این مقاله به شما قول می‌دهم که حداقل یک ذره هم که شده، مسیر جدیدی برای بهتر شدن را پیدا می‌کنید، اگر هم در زمینه توسعه نرم افزار کاملا مبتدی باشید مطمئنا این مقاله موضوعات بسیار زیادی را به شما آموزش خواهد داد. بنابراین بدون تلف کردن وقت بیشتر بیایید با این عادت‌ها و نکات آشنا شویم.",
    author: {
      name: "امید بهاری فر",
      image: "/images/omidbaharifar.jpg",
    },
  },
];

export default blogList;
